================================================================================
decimal
================================================================================

a:=0

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (number))))

================================================================================
hexadecimal
================================================================================

a:=0x400

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (number))))

================================================================================
binary
================================================================================

a:=0b1010

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (number))))

================================================================================
negate
================================================================================

a:=-b

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (negate
        (identifier)))))

================================================================================
addition
================================================================================

a:=1+2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (sum
        (number)
        (number)))))

================================================================================
subtraction
================================================================================

a:=1-2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (subtraction
        (number)
        (number)))))

================================================================================
multiplication
================================================================================

a:=1*2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (product
        (number)
        (number)))))

================================================================================
division
================================================================================

a:=1/2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (division
        (number)
        (number)))))

================================================================================
modulus
================================================================================

a:=1%2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (modulus
        (number)
        (number)))))

================================================================================
addition with multiplication
================================================================================

a:=1+2*3

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (sum
        (number)
        (product
          (number)
          (number))))))

================================================================================
bodmas
================================================================================

a:=-1+2*3/4+(5+6-2)

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (sum
        (sum
          (number)
          (division
            (product
              (number)
              (number))
            (number)))
        (bracketed
          (subtraction
            (sum
              (number)
              (number))
            (number)))))))

================================================================================
bodmas identifiers
================================================================================

a:=-a+b*c/d+(e+f-g)

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (sum
        (sum
          (negate
            (identifier))
          (division
            (product
              (identifier)
              (identifier))
            (identifier)))
        (bracketed
          (subtraction
            (sum
              (identifier)
              (identifier))
            (identifier)))))))

================================================================================
equal
================================================================================

a:=1==2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (cond_equal
        (number)
        (number)))))

================================================================================
not equal
================================================================================

a:=1!=2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (cond_not_equal
        (number)
        (number)))))

================================================================================
less
================================================================================

a:=1<2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (cond_less
        (number)
        (number)))))

================================================================================
less equal
================================================================================

a:=1<=2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (cond_less_equal
        (number)
        (number)))))

================================================================================
greater
================================================================================

a:=1>2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (cond_greater
        (number)
        (number)))))

================================================================================
greater equal
================================================================================

a:=1>=2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (cond_greater_equal
        (number)
        (number)))))

================================================================================
not
================================================================================

a:=!0

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (cond_inver
        (number)))))

================================================================================
binary not
================================================================================

a:=~0

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (bin_not
        (number)))))

================================================================================
post inc
================================================================================

a:=b++

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (post_inc
        (identifier)))))

================================================================================
post dec
================================================================================

a:=b--

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (post_dec
        (identifier)))))

================================================================================
indirect post dec
================================================================================

a:=*b--

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (dereference
        (post_dec
          (identifier))))))

================================================================================
indirect pre inc
================================================================================

a:=*++b

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (dereference
        (pre_inc
          (identifier))))))

================================================================================
pre inc
================================================================================

a:=++b

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (pre_inc
        (identifier)))))

================================================================================
pre dec
================================================================================

a:=--b

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (pre_dec
        (identifier)))))

================================================================================
and
================================================================================

a:=0 && 1

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (logical_and
        (number)
        (number)))))

================================================================================
or
================================================================================

a:=0 || 1

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (logical_or
        (number)
        (number)))))

================================================================================
binary and
================================================================================

a:=0 & 1

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (binary_and
        (number)
        (number)))))

================================================================================
binary or
================================================================================

a:=0 | 1

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (binary_or
        (number)
        (number)))))

================================================================================
subscript value
================================================================================

a:=b[34]

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (subscript
        (identifier)
        (number)))))

================================================================================
as
================================================================================

a:=b as bit

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (as
        (identifier)
        (type
          (bit_type))))))

================================================================================
subscript struct value
================================================================================

a:=c.b[34]

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (subscript
        (dot
          (identifier)
          (identifier))
        (number)))))

================================================================================
as on struct value
================================================================================

a:=c.b as bit

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (as
        (dot
          (identifier)
          (identifier))
        (type
          (bit_type))))))

================================================================================
address of
================================================================================

a:=&b

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (address_of
        (identifier)))))

================================================================================
address of struct value
================================================================================

a:=&b.c

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (address_of
        (dot
          (identifier)
          (identifier))))))

================================================================================
void func call
================================================================================

b:=a()

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (function_call
        (identifier)
        (function_call_args)))))
