================================================================================
negate
================================================================================

a:=-b

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (negate
        (identifier)))))

================================================================================
addition
================================================================================

a:=1+2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (sum
        (number)
        (number)))))

================================================================================
subtraction
================================================================================

a:=1-2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (subtraction
        (number)
        (number)))))

================================================================================
multiplication
================================================================================

a:=1*2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (product
        (number)
        (number)))))

================================================================================
division
================================================================================

a:=1/2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (division
        (number)
        (number)))))

================================================================================
modulus
================================================================================

a:=1%2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (modulus
        (number)
        (number)))))

================================================================================
addition with multiplication
================================================================================

a:=1+2*3

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (sum
        (number)
        (product
          (number)
          (number))))))

================================================================================
bodmas
================================================================================

a:=-1+2*3/4+(5+6-2)

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (sum
        (sum
          (number)
          (division
            (product
              (number)
              (number))
            (number)))
        (bracketed
          (subtraction
            (sum
              (number)
              (number))
            (number)))))))

================================================================================
bodmas identifiers
================================================================================

a:=-a+b*c/d+(e+f-g)

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (sum
        (sum
          (negate
            (identifier))
          (division
            (product
              (identifier)
              (identifier))
            (identifier)))
        (bracketed
          (subtraction
            (sum
              (identifier)
              (identifier))
            (identifier)))))))

================================================================================
equal
================================================================================

a:=1==2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (cond_equal
        (number)
        (number)))))

================================================================================
not equal
================================================================================

a:=1!=2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (cond_not_equal
        (number)
        (number)))))

================================================================================
less
================================================================================

a:=1<2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (cond_less
        (number)
        (number)))))

================================================================================
less equal
================================================================================

a:=1<=2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (cond_less_equal
        (number)
        (number)))))

================================================================================
greater
================================================================================

a:=1>2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (cond_greater
        (number)
        (number)))))

================================================================================
greater equal
================================================================================

a:=1>=2

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (cond_greater_equal
        (number)
        (number)))))

================================================================================
not
================================================================================

a:=!0

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (cond_inver
        (number)))))

================================================================================
post inc
================================================================================

a:=b++

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (post_inc
        (identifier)))))

================================================================================
post dec
================================================================================

a:=b--

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (post_dec
        (identifier)))))

================================================================================
indirect post inc
================================================================================

a:=*b--

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (dereference
        (post_dec
          (identifier))))))

================================================================================
pre inc
================================================================================

a:=++b

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (pre_inc
        (identifier)))))

================================================================================
pre dec
================================================================================

a:=--b

--------------------------------------------------------------------------------

(source_file
  (variable_definition
    (identifier_list
      (identifier))
    (expression
      (pre_dec
        (identifier)))))
